let number = 5; //змінна, може змінюватися, складається з букв, цифр, символів (не може починатися з цифри)
//camelCase - як правило для змінних
//snake_case - як правило для змінних
//UPPER_SNAKE_CASE - часто використовіється для зберігання констант
//kebab-case - як правило для директорій
//PascalCase - як правило для назв класів

var number1 = 5; // старий запис змінної, краще не використовувати 

const userScore = 2000; //константа, інфо змінювати не можна

console.log (number); //вивести у консолі значення змінної number 

// щоб виконати код, треба виділити ВЕСЬ код, правою кнопкою - RUN CODE

const obj = {

    age: 20

}; // об'єкт, джейсон

obj.age = 44; //путь до значення всередині об'єкту/джейсону


//назва змінних має бути зрозумілою і повною
let widthOfCar = 100;
let lenghtOfCar = 200;