// Прості типи даних:
// -числа
let num = 5;
let floatNum = 2.54;
Infinity // коли щось поділити на 0
NaN // якщо дані не одного типу, наприклад число поділити на стрінгу

// -текст
// -логічний (булевий)
let booleanTrue = true;
let booleanFalse = false;

// - null (значення не існує)
let value = null; //у змінної є значення але з ним не можна нічого зробити
console.log (value);

// - undefined (існує, але пусте)
let something;
console.log (something); //у змінної немає значення, не можна знайти

// - Symbol
// - bigInt


// Об'єкти: 
// - Спеціальні об'єкти (глобальні):  масиви, функції, об'єкт дати, помилки, регулярні вирази
//об'єкт
let obj = {};


let person = {
    name:Dmytro,
    age:28,
    isMarried:true
};

let person2 = new Object(); // те саме що пустий об'єкт
person2.name = 'Ivan';
person2.age = 45;
person2.isMarried = false;

console.log(`Вік: ${person2.age}`); //запис як вивести текст і значення змінної, все у косих лапках (які над табом), перед змінною долар, змінна береться у дужки

//масив
let arr1 = [];
let arr2 = [1, 'text', {},[]];

console.log(arr[1]); //путь до елементу масиву за порядковим номером, починається з порядкового номеру 0

// - Звичайні об'єкти (прості): об'єкт {}

//властивості і методи для роботи з текстом
let test ='Hello, world';

console.log(test.length); //вивести властивість цієї змінної - довжину рядка
console.log(test.substring(0,5)); //взяти з тексту з 0 по 6 символи, інше відкинути
console.log(test.toUpperCase); //привести текст до верхнього регістру
console.log(test.toLowerCase); //привести текст до нижнього регістру
console.log(test.indexOf('o')); //узнати номер по порядку букви О, бере тільки першу знайдену
console.log(test.slice(0,5)); //вирізати з тексту букви з 0 по 6 символи
console.log(test.trim); //вирізати всі пробіли
console.log(test.charAt(3)); //вивести букву яка знаходиться з індексом 3
console.log(test[3]); //вивести букву яка знаходиться з індексом 3 (те саме що попередній)
console.log(test.replace("world","Tania")); // замінити у тексті з того що в першому аргументі на те що у другому (якщо знайдено)

//властивості і методи для роботи з масивом
let array = [];

arr.push("Hello"); //додати елемент до масиву 
arr.push(", "); //додати елемент до масиву 
arr.push("world!"); //додати елемент до масиву 
console.log(array.length); //довжина масиву
console.log(array.join("")); //об'єднати елементи масиву
console.log(array[array.length-1]); //вивести останній елемент масиву
console.log(array.pop); //вивести останній елемент масиву (те саме що попередній)

//властивості і методи для роботи з об'єктом

let object = {};
object.a= 2; //додати елемент об'єкту з назвою ключа= а, зі значенням= 2
//інші методи в цілому ті самі

//властивості і методи для роботи з числами

let number = 12.5;

console.log (Math.round(number)); //округлити число
console.log (parseInt(number)); //взяти з числа тільки цілу частину числа
console.log (parseFloat(number)); //конвертує стрінг у число 