/*3.  Напишіть конструкцію if, що перевіряє, чи значення ціни товару не знаходиться між 1000 та 1900 включно.
    Реалізуйте два варіанти, один з оператором НЕ !, а інший без цього оператора.
    Результат виводити в консоль.*/

    let price = 900;

    if (price >=1000 && price <=1900) {
        console.log ("Ціна " + price2 + " входить у діапазон");
    }
    else {
        console.log ("Ціна"  + price2 + "не входить у діапазон");
    }

    let price2 = 1901;

    if (!(price2 >=1000 && price2 <=1900)) {
        console.log ("Ціна " + price2 + " не входить у діапазон");
    }
    else {
        console.log ("Ціна " + price2 + " у діапазоні");
    }