/*5.  Задано 3 числа (a, b, c), які не рівні між собою.
    Визначити середнє мід цими трьома числами
    (не середнє арифметичне значення, а яке з трьох заданих чисел среднє за значенням) використовуючи оператор if-else.
    Використати вкладені оператори if
    Результат виводити в консоль.
    */

let one = 55.55;
let two = 26;
let three = 31.44;

let avg;

if (one<two && two<three) {
    avg = two;
}
else if (two<three && three<one) { 
    avg = three;
}
else {
    avg = one;
}
console.log ("Середньє за значенням число - " + avg);