/*3.  Напишіть конструкцію if, що перевіряє, чи значення ціни товару не знаходиться між 1000 та 1900 включно.
    Реалізуйте два варіанти, один з оператором НЕ !, а інший без цього оператора.
    Результат виводити в консоль.*/

//СТВОРИТИ ФУНКЦІЮ

let price = 1900;

function justIf(a) {
if (a >=1000 && a <=1900) {
    console.log ("Ціна " + a + " входить у діапазон");
}
else {
    console.log ("Ціна "  + a + " не входить у діапазон");
}
}

justIf (price);

let price2 = 1901;

function operatorNot(b) {

if (!(b >=1000 && b <=1900)) {
    console.log ("Ціна " + b + " не входить у діапазон");
}
else {
    console.log ("Ціна " + b + " у діапазоні");
}
}

operatorNot(price2);