/*5.  Задано 3 числа (a, b, c), які не рівні між собою.
    Визначити середнє мід цими трьома числами
    (не середнє арифметичне значення, а яке з трьох заданих чисел среднє за значенням) використовуючи оператор if-else.
    Використати вкладені оператори if
    Результат виводити в консоль.
    */
//СТВОРИТИ ФУНКЦІЮ


let one = 55.55;
let two = 26;
let three = 31.44;


function compareNum (a,b,c) 
{
let avg;

if (a<b && b<c) {
    avg = b;
}
else if (b<c && c<a) { 
    avg = c;
}
else {
    avg = a;
}
return avg;
}

console.log ("Середньє за значенням число - " + (compareNum(one,two,three)));